export type InitialCustomerData = {
	name: string
	debt: number
	phone?: string
}

// Generated from أرصدة الزبائن.xlsx.
export const INITIAL_CUSTOMERS_DATA: InitialCustomerData[] = [
	{
		name: 'ابو ابراهيم ابو حديد',
		debt: 75.5249177839612,
	},
	{
		name: 'ابو البراء عميان',
		debt: 35.0,
	},
	{
		name: 'ابو العبد الهيبي',
		debt: 12.46268656716418,
	},
	{
		name: 'ابو حسن سطوف',
		debt: 26.694915254237294,
	},
	{
		name: 'ابو حسين نصرالله',
		debt: 40.0,
	},
	{
		name: 'ابو حمزة الدبس امير',
		debt: 22.033898305084747,
	},
	{
		name: 'ابو خالد الحنيني',
		debt: 97.45762711864407,
	},
	{
		name: 'ابو خليل العبيلي',
		debt: 33.58208955223881,
	},
	{
		name: 'ابو خليل برمو مخرطة طفس',
		debt: 199.73728813559322,
	},
	{
		name: 'ابو دعاس فادي',
		debt: 11.194029850746269,
	},
	{
		name: 'ابو راشد البردان مساكن جلين',
		debt: 109.3220338983051,
	},
	{
		name: 'ابو زيد المحمدي سيارة ماء',
		debt: 9.661016949152545,
	},
	{
		name: 'ابو سامي .ابو شنب امير',
		debt: 18.682013660511004,
	},
	{
		name: 'ابو شادي جباوي',
		debt: 158.0,
	},
	{
		name: 'ابو صياح البرهومي',
		debt: 124.11522894004553,
	},
	{
		name: 'ابو عبدو دعاس كيا قلاب',
		debt: 108.5,
	},
	{
		name: 'ابو عمران تسيل',
		debt: 145.0,
	},
	{
		name: 'ابو عيد السطوف',
		debt: 23.728813559321992,
	},
	{
		name: 'ابو فادي سابا مطعم',
		debt: 19.91525423728814,
	},
	{
		name: 'ابو ليث الطوبرجي',
		debt: 19.491525423728817,
	},
	{
		name: 'ابو محمد الرفاعي الجسيم',
		debt: 15.95431098010317,
	},
	{
		name: 'ابو محمد مليحه',
		debt: 61.86440677966102,
	},
	{
		name: 'ابو وصفي الربداوي',
		debt: 11.194029850746269,
	},
	{
		name: 'ابو وضحه',
		debt: 10.16949152542373,
	},
	{
		name: 'ابو وليد العقرباوي',
		debt: 20.33898305084746,
	},
	{
		name: 'ابو وليد مجبلي',
		debt: 102.0,
		phone: '0997970301',
	},
	{
		name: 'ابو يزن فرحان الزوباني',
		debt: 54.414368833797084,
	},
	{
		name: 'احمد عبد العزيز قيس',
		debt: 90.00000000000009,
	},
	{
		name: 'احمد مصيبيح .. امير',
		debt: 127.0,
	},
	{
		name: 'ادهم العقرباوي ابو ميار',
		debt: 25.42372881355933,
	},
	{
		name: 'السيارة السوزي',
		debt: 1104.1101694915253,
	},
	{
		name: 'المركز ابوي ابو عايش 2026',
		debt: 107.19706551985837,
	},
	{
		name: 'امير...ابو وائل الربداوي',
		debt: 123.50470149253738,
	},
	{
		name: 'ايمن عطية ابو يزن',
		debt: 525.0,
	},
	{
		name: 'باص اخو ابو احمد الشجرة',
		debt: 80.0,
	},
	{
		name: 'جهاد العوضي ابو احمد',
		debt: 883.1864406779661,
	},
	{
		name: 'حسن المساكن',
		debt: 26.813003612114436,
	},
	{
		name: 'حسن نميري',
		debt: 79.62288135593221,
	},
	{
		name: 'حسين الساعدي',
		debt: 11.940298507462687,
	},
	{
		name: 'حمودة ابو حمدة',
		debt: 16.94915254237287,
	},
	{
		name: 'حمودة عطية باقر',
		debt: 13.805970149253731,
	},
	{
		name: 'حمودة مبسبس',
		debt: 135.59322033898306,
	},
	{
		name: 'راتب سليمان ابو عمر',
		debt: 61.377434859600356,
	},
	{
		name: 'ركان الحلاب الهاروني',
		debt: 37.6043511257273,
	},
	{
		name: 'زياد السيطري',
		debt: 36.4406779661017,
	},
	{
		name: 'زيد العوضي .ابو ايهم',
		debt: 670.0004237288135,
	},
	{
		name: 'سرفيس جمعه',
		debt: 84.74576271186442,
	},
	{
		name: 'سعيد الهلال عموريا',
		debt: 60.593220338983045,
	},
	{
		name: 'شادي الزوباني',
		debt: 127.11864406779661,
	},
	{
		name: 'شادي هويمل',
		debt: 53.04831773336707,
	},
	{
		name: 'شادي هويمل حصادة',
		debt: 25.014925373134332,
	},
	{
		name: 'شادي هويمل دراسه',
		debt: 25.423728813559322,
	},
	{
		name: 'صاحب ابو رغيد طفس',
		debt: 29.661016949152547,
	},
	{
		name: 'صياح الشامي فادي',
		debt: 37.28813559322034,
	},
	{
		name: 'ضياء شقران تل شهاب',
		debt: 144.77611940298507,
	},
	{
		name: 'طارق الربداوي',
		debt: 9.322033898305085,
		phone: '0935631759',
	},
	{
		name: 'عبد الباسط الغادة',
		debt: 22.88135593220339,
	},
	{
		name: 'عبود الشامي عده',
		debt: 43.283582089552255,
	},
	{
		name: 'عزالدين مصيبيح قيس',
		debt: 42.796610169491515,
	},
	{
		name: 'عصام الخروبي',
		debt: 124.99999999999989,
	},
	{
		name: 'عمر ابو ليلى تل شهاب',
		debt: 10.0,
	},
	{
		name: 'عمر بلاستيك',
		debt: 21.18644067796606,
	},
	{
		name: 'عمر شحاده',
		debt: 11.864406779661017,
	},
	{
		name: 'عيد الديري كيا 4000',
		debt: 56.109284088034414,
	},
	{
		name: 'فادي الخالدي',
		debt: 80.00000000000023,
	},
	{
		name: 'فؤاد الزوباني ابن عمي',
		debt: 106.77966101694916,
	},
	{
		name: 'قاسم بردان طفس',
		debt: 329.9997936624908,
	},
	{
		name: 'قاسم كيزان',
		debt: 16.525423728813564,
	},
	{
		name: 'ليث نميري',
		debt: 10.0,
		phone: '0997778449',
	},
	{
		name: 'مالك الحنيني ابو فيصل',
		debt: 22.388059701492537,
	},
	{
		name: 'مجبلي اذاعة',
		debt: 37.71186440677968,
	},
	{
		name: 'محمد العيسى البردان',
		debt: 11.440677966101688,
	},
	{
		name: 'محمد الغزاوي المساكن',
		debt: 28.8135593220339,
	},
	{
		name: 'محمد الفلاح امير كيا اخضر',
		debt: 25.423728813559325,
	},
	{
		name: 'محمود الشمري',
		debt: 15.425499620541345,
	},
	{
		name: 'محمود فرحان النابلسي',
		debt: 86.19402985074626,
	},
	{
		name: 'مدين الساعدي',
		debt: 10.16949152542373,
	},
	{
		name: 'مركز الزيتون',
		debt: 2018.220338983051,
	},
	{
		name: 'مصطفى النابلسي ابو البراء',
		debt: 143.51557377049178,
	},
	{
		name: 'مصطفي ابو احمد الشجرة',
		debt: 502.9029508196727,
	},
	{
		name: 'معمر الميساوي',
		debt: 24.253731343283583,
	},
	{
		name: 'مهند الجمال',
		debt: 97.01492537313432,
	},
	{
		name: 'مهند هويمل',
		debt: 11.01694915254236,
	},
	{
		name: 'مهيب سيارة انتر 65',
		debt: 26.27118644067795,
	},
	{
		name: 'نادر عديسات',
		debt: 16.949152542372886,
	},
	{
		name: 'نصر الظاهر الربايعة',
		debt: 28.389830508474578,
	},
	{
		name: 'نضال عزوز',
		debt: 27.238805970149254,
	},
	{
		name: 'نورس كيوان ابو رضا',
		debt: 166.96610169491527,
	},
	{
		name: 'ياسر العمقي',
		debt: 13.432835820895521,
	},
]
